#include <iostream>
#include "book.h"
//методы класса Book//
//в конструкторе задаём Название и Автора
Book::Book(string n, string Au) : Title(n), Author(Au)
{

}
//---------------------------------------------------------

Book::~Book() // деструктор
{

}
//---------------------------------------------------------

string Book::getAuthor() //геттер возвращает Название
{
    return Author;
}
//--------------------------------------------------------

string Book::getTitle() //геттер возвращает Автора
{
    return Title;
}
//---------------------------------------------------------
